go-go-golems/esp32-s3-m5/0095-cores3-wifi-bench/sdkconfig.defaults
# CoreS3 WiFi Benchmark — sdkconfig.defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# USB Serial/JTAG console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART is not set

# Flash: QIO 80 MHz (CoreS3 uses QIO flash)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8 MB Quad (CoreS3, not Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y

# CPU at 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# WiFi: default buffer settings (matching Tab5 baseline for fair comparison)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# Partition table

# AP SSID
CONFIG_AP_SSID="CoreS3-Bench"
